Revit 2024 API
BuiltInFailures.ColumnInsideWallFailures Class
 Failures description ColumnInsideWall
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ColumnInsideWallFailures
Visual Basic
Public NotInheritable Class ColumnInsideWallFailures
Visual C++
public ref class ColumnInsideWallFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures
See Also
BuiltInFailures.ColumnInsideWallFailures Members
Autodesk.Revit.DB Namespace